org/question-2021-26.org
#+SETUPFILE: ./hugo_setup.org
#+TITLE: 2021年第26周问题汇总
#+DATE: <2021-06-27 Sun>
2021-06-21 ~ 2021-06-27

- 在笔记本插U盘，看ppt，突然 nautilus
  文件管理程序里的文件夹开始闪烁，关闭文件夹窗口，再打开还是不行。

  想打开终端，结果直接显示一个 tty2
  终端，全黑的，没有桌面环境。最后只好在终端输入 reboot
  重启，之后就好了。

- JavaScript 中，单双引号的区别在哪里？

- 一个人告诉我，我觉得你戴着帽子和口罩，特别像杀人犯。我当时心里一惊，转而觉得确实有点像，然后我就开始苦恼起来：别人为什么这样评价我的打扮？

  Why would I change myself to adapt for others' feelings or willing?

  我不该这样，这只是我个人的喜好，我从未觉得戴着帽子和口罩有什么不妥。直到别人的一句无心之话。我动摇了，怀疑自己的行为。但这只是我的行为，没有多余的含义。

  ------

  所有这些都只是我的个人想法或者感受。这些想法和感受最终的目的就让我更清晰地认识自己。

- 运动会上，运动员在跑百米前、中、后的身体状态是怎样的？

- 记录一个有意思的问题：拆完英菲克的PM9无线鼠标后，主观认为没动什么部件，但鼠标滚轮的方向变了。

  最后发现：在Ubuntu设置中的Mouse，打开了Natural
  Scrolling。这样做的结果：移动内容content，不是移动视图view。

  默认的设置，是移动视图view
